In [1]:
import pandas as pd
import os
from sqlalchemy import create_engine
from config import my_password

In [2]:
train_df = pd.read_csv('aug_train.csv')

In [3]:
train_df.head()
train_df.columns

Index(['enrollee_id', 'city', 'city_development_index', 'gender',
       'relevent_experience', 'enrolled_university', 'education_level',
       'major_discipline', 'experience', 'company_size', 'company_type',
       'last_new_job', 'training_hours', 'target'],
      dtype='object')

In [4]:
train_df.drop(['enrollee_id', 'city', 'city_development_index', 'experience', 'last_new_job', 'training_hours'], axis = 'columns', inplace = True)
train_df.head()

,gender,relevent_experience,enrolled_university,education_level,major_discipline,company_size,company_type,target
0,Male,Has relevent experience,no_enrollment,Graduate,STEM,NaN,NaN,1.0
1,Male,No relevent experience,no_enrollment,Graduate,STEM,50-99,Pvt Ltd,0.0
2,NaN,No relevent experience,Full time course,Graduate,STEM,NaN,NaN,0.0
3,NaN,No relevent experience,NaN,Graduate,Business Degree,NaN,Pvt Ltd,1.0
4,Male,Has relevent experience,no_enrollment,Masters,STEM,50-99,Funded Startup,0.0

In [5]:
train_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 19158 entries, 0 to 19157
Data columns (total 8 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   gender               14650 non-null  object
 1   relevent_experience  19158 non-null  object
 2   enrolled_university  18772 non-null  object
 3   education_level      18698 non-null  object
 4   major_discipline     16345 non-null  object
 5   company_size         13220 non-null  object
 6   company_type         13018 non-null  object
 7   target               19158 non-null  float64
dtypes: float64(1), object(7)
memory usage: 1.2+ MB

In [6]:
train_df.dropna(how='any', inplace=True)
train_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 8983 entries, 1 to 19155
Data columns (total 8 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   gender               8983 non-null   object
 1   relevent_experience  8983 non-null   object
 2   enrolled_university  8983 non-null   object
 3   education_level      8983 non-null   object
 4   major_discipline     8983 non-null   object
 5   company_size         8983 non-null   object
 6   company_type         8983 non-null   object
 7   target               8983 non-null   float64
dtypes: float64(1), object(7)
memory usage: 631.6+ KB

In [7]:
train_df.to_csv('train_cleaned.csv', index=False)

In [8]:
male_filter = train_df['gender'] == 'Male'
train_male_df = train_df[male_filter]
train_male_df.head()

,gender,relevent_experience,enrolled_university,education_level,major_discipline,company_size,company_type,target
1,Male,No relevent experience,no_enrollment,Graduate,STEM,50-99,Pvt Ltd,0.0
4,Male,Has relevent experience,no_enrollment,Masters,STEM,50-99,Funded Startup,0.0
7,Male,Has relevent experience,no_enrollment,Graduate,STEM,<10,Pvt Ltd,1.0
8,Male,Has relevent experience,no_enrollment,Graduate,STEM,50-99,Pvt Ltd,1.0
11,Male,Has relevent experience,no_enrollment,Graduate,STEM,5000-9999,Pvt Ltd,0.0

In [9]:
female_filter = train_df['gender'] == 'Female'
train_female_df = train_df[female_filter]
train_female_df.head()

,gender,relevent_experience,enrolled_university,education_level,major_discipline,company_size,company_type,target
33,Female,Has relevent experience,no_enrollment,Graduate,STEM,100-500,Pvt Ltd,0.0
40,Female,Has relevent experience,Full time course,Masters,STEM,1000-4999,Public Sector,0.0
68,Female,Has relevent experience,no_enrollment,Masters,Humanities,500-999,Public Sector,0.0
79,Female,Has relevent experience,no_enrollment,Masters,STEM,<10,Early Stage Startup,0.0
86,Female,No relevent experience,Part time course,Graduate,STEM,10/49,Pvt Ltd,0.0

In [10]:
train_male_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 8098 entries, 1 to 19155
Data columns (total 8 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   gender               8098 non-null   object
 1   relevent_experience  8098 non-null   object
 2   enrolled_university  8098 non-null   object
 3   education_level      8098 non-null   object
 4   major_discipline     8098 non-null   object
 5   company_size         8098 non-null   object
 6   company_type         8098 non-null   object
 7   target               8098 non-null   float64
dtypes: float64(1), object(7)
memory usage: 569.4+ KB

In [11]:
train_female_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 806 entries, 33 to 19152
Data columns (total 8 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   gender               806 non-null    object
 1   relevent_experience  806 non-null    object
 2   enrolled_university  806 non-null    object
 3   education_level      806 non-null    object
 4   major_discipline     806 non-null    object
 5   company_size         806 non-null    object
 6   company_type         806 non-null    object
 7   target               806 non-null    float64
dtypes: float64(1), object(7)
memory usage: 56.7+ KB

In [12]:
male_sample_df = train_male_df.sample(n=805)
male_sample_df.head()

,gender,relevent_experience,enrolled_university,education_level,major_discipline,company_size,company_type,target
12082,Male,Has relevent experience,no_enrollment,Graduate,STEM,100-500,Pvt Ltd,0.0
1113,Male,Has relevent experience,no_enrollment,Masters,STEM,<10,Early Stage Startup,0.0
13730,Male,Has relevent experience,no_enrollment,Graduate,STEM,1000-4999,Pvt Ltd,0.0
9808,Male,Has relevent experience,no_enrollment,Graduate,STEM,500-999,Pvt Ltd,1.0
15500,Male,Has relevent experience,no_enrollment,Graduate,STEM,50-99,Pvt Ltd,0.0

In [13]:
merged_df = pd.concat([male_sample_df, train_female_df], axis=0)
merged_df.head()

,gender,relevent_experience,enrolled_university,education_level,major_discipline,company_size,company_type,target
12082,Male,Has relevent experience,no_enrollment,Graduate,STEM,100-500,Pvt Ltd,0.0
1113,Male,Has relevent experience,no_enrollment,Masters,STEM,<10,Early Stage Startup,0.0
13730,Male,Has relevent experience,no_enrollment,Graduate,STEM,1000-4999,Pvt Ltd,0.0
9808,Male,Has relevent experience,no_enrollment,Graduate,STEM,500-999,Pvt Ltd,1.0
15500,Male,Has relevent experience,no_enrollment,Graduate,STEM,50-99,Pvt Ltd,0.0

In [14]:
merged_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1611 entries, 12082 to 19152
Data columns (total 8 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   gender               1611 non-null   object
 1   relevent_experience  1611 non-null   object
 2   enrolled_university  1611 non-null   object
 3   education_level      1611 non-null   object
 4   major_discipline     1611 non-null   object
 5   company_size         1611 non-null   object
 6   company_type         1611 non-null   object
 7   target               1611 non-null   float64
dtypes: float64(1), object(7)
memory usage: 113.3+ KB

In [15]:
merged_df.to_csv('train_balanced.csv', index=False)

## Connect to Postgres Database

In [16]:
rds_connection_string = "postgres:password@localhost:5432/job_change"
engine = create_engine(f'postgresql://{rds_connection_string}')

In [17]:
engine.table_names()

['alembic_version', 'response', 'train_balanced', 'test_balanced']

## Export DataFrame to SQL

In [18]:
merged_df.to_sql(name='train_balanced', con=engine, if_exists='replace', index=False)